# 原文件名: global_db(卡牌关键词).gd
# 功能: 卡牌关键词库
#class_name GlobalDB
extends Node

## 关键词库：包含颜色和详细解释
const KEYWORDS: Dictionary = {
	"消耗": {
		"color": "#aaaaaa",
		"desc": "打出这张牌后，将其置入消耗区而不是弃牌堆"
	},
	"洗脑": {
		"color": "#cda4ff",
		"desc": "将目标转化为信徒"
	},
	"易伤": {
		"color": "#ff4d4d",
		"desc": "使目标受到的所有攻击伤害增加50%"
	},
	"中毒": {
		"color": "#3b632800",
		"desc": "每回合开始目标受到中毒层数的伤害，并且每回合向周围扩散，同时层数减1"
	},
	"迷信": {
		"color": "#750a9900",
		"desc": "目标以及目标周围一圈的单位进化速度变缓"
	},
	"嗜血": {
		"color": "#750a9900",
		"desc": "目标失去生产能力，行动改为攻击友方单位"
	},
	"启蒙": {
		"color": "#1b00cd00",
		"desc": "目标每回合结束增加一次特殊行动，推动时间轴一格"
	},
}

## 文本替换图标
## 注意：请把这里的路径换成你项目里真实的图片路径
const ICONS: Dictionary = {
	"[ATK]": "res://图片/fc155.png",
	"[能量]": "res://图片/fc172.png"
}
